Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/reference/checklists/checklist_of_procedures_for_a_non_eea_national_living_outside_ireland_who_is_marrying_an_irish_national_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Checklist for a non-EEA national living outside Ireland who is marrying an Irish national in Ireland
ga: Seicliosta do náisiúnach nach ón Limistéar Eorpach Eacnamaíoch dó, atá ina chónaí lasmuigh d’Éirinn agus atá ag pósadh náisiúnach Éireannach

source: A non-EEA national who is marrying an Irish national does not have to be resident in Ireland in order for it to take place in Ireland
ga: Ní chaithfidh náisiúnach nach ón Limistéar Eorpach Eacnamaíoch dó, agus atá ag pósadh náisiúnach Éireannach, a bheith ina chónaí in Éirinn go dtarlódh an pósadh in Éirinn

source: However, there are certain procedures that must be followed if you are living outside Ireland
ga: Áfach, tá nósanna imeachta áirithe ann a chaithfear a leanúint má tá tú i do chónaí lasmuigh d’Éirinn

source: It is very important to comply with the rules regarding residence for non-EEA nationals in Ireland and the legal requirements for getting married in Ireland
ga: Tá sé an-tábhachtach go gcomhlíonfar na rialacha maidir le cónaí in Éirinn do náisiúnaigh nach ón LEE dóibh agus na ceanglais dlíthiúla maidir le pósadh in Éirinn

source: You must notify the Registrar that you are getting married
ga: Caithfear a chur in iúl don Chláraitheoir go mbeidh tú ag pósadh

source: This must be done at least 3 months before the marriage
ga: Caithfear é seo a dhéanamh 3 mhí ar a laghad roimh an bpósadh

source: You must get permission from the Registrar for the non-EEA national to make the 3-month notification by post
ga: Caithfear cead a fháil ón gCláraitheoir don náisiúnach nach ónLEE dó chun an fógra trí mhí a dhéanamh sa phost

source: The non-EEA national must meet the Registrar in person at least 5 days before the marriage
ga: Caithfidh an náisiúnach nach ón LEE dó bualadh leis an gCláraitheoir go pearsanta 5 lá ar a laghad roimh an bpósadh

source: As one of you is an non-EEA national, you will both have to attend a separate interview
ga: Toisc is náisiúnach neamh-LEE aon duine agaibh, caithfidh sibh agallamh ar leith a freastal

source: Under the Civil Registration (Amendment) Act 2014, the Registrar has the right to investigate and decide whether an intended marriage would be a “marriage of convenience” for immigration purposes
ga: Faoin Acht um Chlárú Sibhialta (Leasú) 2014, tá ceart ag an gCláraitheoir imscrúdaigh agus cinneadh gur an pósadh beartaithe é “pósadh áisiúlachta” do chuspóirí inimirce

source: A non-EEA national who requires a visa to come to Ireland can apply for a short-stay visa (a ‘C’ visa) to visit Ireland
ga: Is féidir le náisiúnach nach ón LEE dó agus a mbíonn víosa riachtanach dó chun teacht go hÉirinn cur isteach ar víosa gearrchónaithe (víosa ‘C’) chun cuairt a thabhairt ar Éirinn

source: After arriving in Ireland the non-EEA national should get permission to remain by registering with the local immigration registration officer
ga: Tar éis teacht i dtír in Éirinn ba chóir don náisiúnach nach ónLEE dó cead a fháil chun fanacht trí chlárú leis an oifigeach clárúcháin inimirce áitiúil

source: In Dublin this is the Burgh Quay Registration Office and you must book an appointment online to visit it
ga: I mBaile Átha Cliath cláraítear ag Oifig Chlárúcháin Cé an Bhúrcaigh agus caithfidh tú coinne a scríobh isteach ar líne chun cuairt a thabhairt air

source: Outside Dublin it is at your regional registration office or your local Garda District Headquarters
ga: Lasmuigh de Bhaile Átha Cliath cláraítear ag oifig chlárúcháin régiúnach nó Ceanncheathrú Ceantair an Gharda Síochána

source: 3 will be placed in the non-EEA national’s passport, which means they are not allowed to work in Ireland
ga: 3 i bpas an náisiúnaigh nach ónLEE dó, rud a chiallaíonn nach bhfuil cead aige nó aici oibriú in Éirinn

source: You can find information about immigration stamps on the Irish Naturalisation and Immigration Service (INIS) website
ga: Is féidir leat eolas a aimsiú faoi stampaí inimirce ar láithreán gréasáin Sheirbhís Eadóirseachta agus Inimirce na hÉireann (SEIE)

source: Both the non-EEA national and the Irish national should visit the Registrar in person to get the Marriage Registration Form at least 5 days before the marriage
ga: Ba chóir don náisiúnach nach ónLEE dó mar aon leis an Náisiúnach Éireannach cuairt a thabhairt ar an gCláraitheoir go pearsanta chun an Fhoirm Chláraithe Pósta a fháil 5 lá ar a laghad roimh an bpósadh

source: If the non-EEA spouse has a short-stay (C) visa they must leave Ireland before the expiry date of the stay granted by the immigration authorities - the maximum stay is 3 months
ga: Má tá víosa gearrchónaithe (C) ag an náisiúnach nach ónLEE dó caithfidh sé nó sí imeacht as Éirinn roimh dháta éaga an cheada gearrchónaithe arna dheonú ag na húdaráis inimirce - is í an uastréimhse chónaithe ná 3 mhí

source: If the non-EEA spouse intends to return to Ireland to live with their Irish spouse, they can then apply for a long-stay (D) visa
ga: Má tá sé de rún ag céile an náisiúnaigh nach ónLEE dó filleadh ar Éirinn chun cónaí lena chéile nó lena céile Éireannach is féidir leis nó léi cur isteach ar víosa fadchónaithe (D)

source: On arrival in Ireland the non-EEA spouse must register with the local immigration registration officer as the spouse of an Irish national
ga: Ar theacht i dtír in Éirinn don chéile nach ónLEE dó caithfear clárú leis an oifigeach clárúcháin inimirce áitiúil mar chéile náisiúnach Éireannach

source: If the non-EEA spouse is not required to have a visa they must register with the local immigration registration officer as the spouse of an Irish national
ga: Mura gceanglaítear ar an gcéile nach ónLEE dó víosa a bheith aige caithfear clárú leis an oifigeach clárúcháin inimirce áitiúil mar chéile náisiúnach Éireannach

source: Registering as the spouse of an Irish national: It is important that the non-EEA spouse is accompanied by their Irish spouse when applying for registration to the local immigration registration officer
ga: Ag clárú mar chéile náisiúnach Éireannach Tá sé tábhachtach go mbíonn an chéile Éireannach i dteannta na céile nach ónLEE dó agus iad ag déanamh iarratais ar chlárúchán leis an oifigeach clárúcháin inimirce áitiúil

source: They must bring with them the marriage certificate and both valid passports
ga: Caithfidh siad an deimhniú pósta agus an dá phas bhailí a thabhairt leo

source: The residence stamp granted will depend on whether the local immigration registration officer is satisfied that the marriage is genuine
ga: Beidh an stampa cónaithe a dheonófar ag brath ar cibé an deimhin leis an oifigeach clárúcháin inimirce áitiúil gur fíorphósadh atá ann

source: If sufficient evidence is presented to prove the marriage is genuine, a stamp 4 may be issued to the non-EEA national spouse
ga: Má chuirtear dóthain fianaise i láthair lena chruthú gur fíorphósadh atá ann, féadfar stampa 4 a eisiúint don chéile nach ónLEE dó

source: If not, the case may be referred to the Irish Naturalisation and Immigration Service
ga: Mura ndéantar amhlaidh, féadfar an cás a chur ar aghaidh chuig Seirbhís Eadóirseachta agus Inimirce na hÉireann

source: There is no automatic entitlement to residence in Ireland following marriage to an Irish national
ga: Ní bhíonn aon teidlíocht láithreach ag duine ar chónaí in Éirinn tar éis náisiúnach Éireannach a phósadh

source: You can find further details about registering as the spouse of an Irish national on the INIS website
ga: Is féidir leat tuilleadh mionsonraí a aimsiú faoi chlárú mar chéile náisiúnach Éireannach ar láithreán gréasáin SEIÉ

source: Non-EEA nationals who are married to Irish nationals do not require a permit to work in Ireland once they have a stamp 4 endorsed on their passport
ga: Ní bhíonn ceadúnas oibre ag teastáil ó náisiúnaigh nach ón LEE dóibh agus atá pósadh náisiúnaigh Éireannacha nuair a bhíonn stampa 4 formhuinithe ar a bpas

source: A non-EEA national spouse who has been married to an Irish national for 3 years and meets certain residence requirements may apply for Irish citizenship
ga: Féadfaidh náisiúnach nach ón LEE dó atá pósta ar náisiúnach Éireannach ar feadh 3 bliana agus a chomhlíonann ceanglais chónaithe áirithe iarratas a dhéanamh ar shaoránacht Éireannach
